{"class_name": "Model", "config": {"name": "model_43", "layers": [{"name": "input_85", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 79, 79, 6], "dtype": "float32", "sparse": false, "name": "input_85"}, "inbound_nodes": []}, {"name": "conv2d_253", "class_name": "Conv2D", "config": {"name": "conv2d_253", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_85", 0, 0, {}]]]}, {"name": "batch_normalization_169", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_169", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_253", 0, 0, {}]]]}, {"name": "max_pooling2d_127", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_127", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_169", 0, 0, {}]]]}, {"name": "conv2d_254", "class_name": "Conv2D", "config": {"name": "conv2d_254", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_127", 0, 0, {}]]]}, {"name": "batch_normalization_170", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_170", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_254", 0, 0, {}]]]}, {"name": "max_pooling2d_128", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_128", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_170", 0, 0, {}]]]}, {"name": "conv2d_255", "class_name": "Conv2D", "config": {"name": "conv2d_255", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_128", 0, 0, {}]]]}, {"name": "batch_normalization_171", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_171", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_255", 0, 0, {}]]]}, {"name": "max_pooling2d_129", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_129", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_171", 0, 0, {}]]]}, {"name": "conv2d_256", "class_name": "Conv2D", "config": {"name": "conv2d_256", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_129", 0, 0, {}]]]}, {"name": "batch_normalization_172", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_172", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_256", 0, 0, {}]]]}, {"name": "conv2d_257", "class_name": "Conv2D", "config": {"name": "conv2d_257", "trainable": true, "dtype": "float32", "filters": 2048, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_172", 0, 0, {}]]]}, {"name": "conv2d_258", "class_name": "Conv2D", "config": {"name": "conv2d_258", "trainable": true, "dtype": "float32", "filters": 3362, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_257", 0, 0, {}]]]}, {"name": "softmax_43", "class_name": "Softmax", "config": {"name": "softmax_43", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["conv2d_258", 0, 0, {}]]]}, {"name": "reshape_85", "class_name": "Reshape", "config": {"name": "reshape_85", "trainable": true, "dtype": "float32", "target_shape": [3362, 1]}, "inbound_nodes": [[["softmax_43", 0, 0, {}]]]}, {"name": "input_86", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3362, 3], "dtype": "float32", "sparse": false, "name": "input_86"}, "inbound_nodes": []}, {"name": "dot_43", "class_name": "Dot", "config": {"name": "dot_43", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "inbound_nodes": [[["reshape_85", 0, 0, {}], ["input_86", 0, 0, {}]]]}, {"name": "reshape_86", "class_name": "Reshape", "config": {"name": "reshape_86", "trainable": true, "dtype": "float32", "target_shape": [3]}, "inbound_nodes": [[["dot_43", 0, 0, {}]]]}], "input_layers": [["input_85", 0, 0], ["input_86", 0, 0]], "output_layers": [["reshape_86", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}